titan-core/src/main/resources/META-INF/domain/domain.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
	<env:Header xmlns:env="http://www.w3.org/2003/05/soap-envelope">
		<wsse:Security
			xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
			xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
			soap:mustUnderstand="true">
			<wsse:UsernameToken wsu:Id="UsernameToken-1">
				<wsse:Username>ws-client</wsse:Username>
				<wsse:Password
					Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">J/FI8wEOcCZ946IaGdT9FQ==</wsse:Password>
			</wsse:UsernameToken>
		</wsse:Security>
	</env:Header>
	<soap:Body>
		<ns2:sayHi xmlns:ns2="http://test.elementi.com.br/">
			<text>Eltonsolid</text>
		</ns2:sayHi>
	</soap:Body>
</soap:Envelope>